In [ ]:
df['V1'].value_counts()

In [ ]:
df['V1'].value_counts().plot(kind='bar')

In [ ]:
not_vacc = df[df['v1']==0]

In [ ]:
Age_Total=[]
for i in Age_group:
    r= Age_group[i].sum()
    Age_Total.append(r)

In [ ]:
import plotly.express as px
fig=px.bar(Age_df, y='Total', x='Attributes', text_auto=.2s', title="California_Age_not_vaccinated)
fig.update_traces(textfont_size=12, textangle=0,textposition="outside",cliponaxis=False)
figshow()

In [16]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plot
df = pd.read_csv(r"C:\Users\User\Downloads\titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [24]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plot
df = pd.read_csv(r"C:\Users\User\Downloads\titanic.csv")
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [28]:
df.shape

(891, 5)

In [11]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plot
df = pd.read_csv(r"C:\Users\User\Downloads\titanic.csv")
target=df.Survived
inputs = df.drop('Survived',axis='columns')

In [13]:
inputs['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [15]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female   male
0   False   True
1    True  False
2    True  False
3    True  False
4   False   True

In [17]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,female,male
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,False,True
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,True,False
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,True,False

In [19]:
inputs.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
female           0
male             0
dtype: int64

In [21]:
inputs.Age = inputs.Age.fil lna(inputs.Age.mean())